<?php
    // Перевірка , чи всі дані отримались.
    if(empty($_GET)){ 
        echo "Заповніть будь ласка всі поля!";
    }
    else{
        $i = 0; // змінна для циклу
        $num1 = $_GET["number-1"]; // 
        $num2 = $_GET["number-2"]; //    змінні для отримання даних з полей форми
        $num3 = $_GET["number-3"]; //

        // перевірка, якщо сума чисел більша ніж 50, то в циклі виводяться ці числа збільшені на 10.
        if(($num1 + $num2 + $num3) > 50){ 
            while($i < 3){
                echo "Число " . ++$i . " дорівнює: " . ($_GET["number-".$i]+10) . "<br>";
            }
        }
        // якщо сума менше, виводяться ці числа зменшені в два рази.
        else{
            while($i < 3){
                echo "Число " . ++$i . " дорівнює: " . ($_GET["number-".$i]/2) . "<br>";
            }
        }
    }
?>