<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Lab 2_1</title>
</head>
<body>
    <h3>240 екскурсантів можна розсадити в автобуси ЛАЗ (місткість – 40 осіб) і ПАЗ (місткість – 30 осіб).</h3>
    <?php 
        $q = 0;
        for($i = 0; $i < 6; $i++){
            for($y = 0; $y < 8; $y++){
                if( 40 * $i + 30 * $y == 240){
                    echo "<h4>Можна замовити " . $i . " ЛАЗ та " . $y . " ПАЗ щоб розмістити всі пасажирів.</h4>";
                    $q++;
                }
            }
        }
        echo "<h4>Кількість варіантів всіх можливих замовлень автобусів для перевезення пасажирів дорівнює : " . $q . "</h4>";
    ?>
</body>
</html>