<?php
    // Перевірка , чи всі дані отримались.
    if(!empty($_GET)){ 
        
        $num = $_GET["number-1"]; // змінна зі значення із поля форми
        //  switch case для перевірки числа та виведення відповідного тексту
        switch($num){
            case 1: echo "День буде вдалим!"; break;
            case 2: echo "Передбачається подорож!"; break;
            case 3: echo "День буде не вдалим!"; break;
            case 4: echo "Краще утриматись від подорожей!"; break;
            case 5: echo "День буде вдалим та радісним для Вас!"; break;
            default: echo "Число не входить в діапазон цілих чисел від 1 до 5!<br>
                           <h3>Заповніть будь ласка форму ще раз!<h3>";break;
        }
    }
    else{
        echo "Заповніть будь ласка полe!";
    }
?>