<?php
    echo "Дана двовимірна матриця чисел А [1..N, 1..N]. Знайдіть суму заштрихованих елементів<br>";
    echo "<img alt='lab' src='1.png'> <br><br>";
    $arr = [7][7];
    $summ = 0;
    for($i = 0; $i < 8; $i++){
        for($j = 0; $j < 8; $j++){
            $arr[$i][$j] = mt_rand(1,5);
            echo "......" . $arr[$i][$j];
            if($j == 7){
                $summ += $arr[$i][$j];
                echo "......";
            }
            if($j == 6 && $i>=1 && $i <=6){
                $summ += $arr[$i][$j];
            }
            if($j == 5 && $i>=2 && $i <=5){
                $summ += $arr[$i][$j];
            }
            if($j == 4 && $i>=3 && $i <=4){
                $summ += $arr[$i][$j];
            }
        }
        echo "<br>";
        
    }
    echo "Сума заштрихованих елементів дорівнює :" . $summ;
?>